cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "bat"
brew "coreutils"
brew "exa"
brew "ghq"
brew "git"
brew "go"
brew "mas"
brew "nano"
# brew "rsync"
brew "source-highlight"
brew "starship"
brew "wget"

cask "1password"
cask "alfred"
cask "daisydisk"
cask "dash"
cask "dropbox"
cask "font-fira-code-nerd-font"
cask "font-myrica"
# cask "font-myricam"
cask "fork"
cask "fuwari"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
# cask "omnigraffle"
cask "path-finder"
# cask "qlcolorcode"
# cask "qlmarkdown"
# cask "qlstephen"
# cask "quicklook-json"
cask "visual-studio-code"
# cask "vmware-fusion"
cask "xnconvert"

mas "AdGuard for Safari", id: 1440147259
mas "Spark", id: 1176895641
mas "uBlacklist for Safari", id: 1547912640
