cask_args appdir: "/Applications"

brew "docker-completion"
brew "bat"
brew "coreutils"
brew "eza"
brew "ghq"
brew "git"
brew "go"
brew "mas"
brew "nano"
brew "rsync"
brew "source-highlight"
brew "starship"
brew "wget"

cask "1password@7"
cask "alfred"
cask "bettertouchtool"
cask "daisydisk"
cask "dash"
cask "docker-desktop"
cask "dropbox"
cask "font-fira-code-nerd-font"
cask "font-udev-gothic-nf"
cask "fork"
cask "ghostty"
cask "google-chrome"
cask "karabiner-elements"
cask "keka"
# cask "omnigraffle"
cask "path-finder"
cask "raycast"
cask "readdle-spark"
cask "shottr"
cask "tableplus"
cask "visual-studio-code"
cask "xnconvert"

mas "AdGuard for Safari", id: 1440147259
mas "uBlacklist for Safari", id: 1547912640
