cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/cask-fonts"

# brew "bat"
brew "coreutils"
# brew "exa"
brew "git"
brew "go"
brew "nano"
# brew "rsync"
brew "source-highlight"
brew "wget"

cask "1password"
cask "alfred"
cask "daisydisk"
cask "dash"
cask "font-inconsolata-nerd-font"
cask "font-myrica"
# cask "font-myricam"
cask "fork"
cask "fuwari"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
# cask "omnigraffle"
cask "path-finder"
# cask "qlcolorcode"
# cask "qlmarkdown"
# cask "qlstephen"
# cask "quicklook-json"
cask "visual-studio-code"
# cask "vmware-fusion"
cask "xnconvert"

mas "Spark", id: 1176895641
